Revit 2026 API

# View3DCanSaveOrientation Method

---

Returns true if the View3D's orientation can be saved, false otherwise.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanSaveOrientation()
```
```vb
Public Function CanSaveOrientation As Boolean
```
```cpp
public:
bool CanSaveOrientation()
```
```fsharp
member CanSaveOrientation : unit -> bool
```

#### Return Value

Boolean True if the View3D's orientation can be saved, false otherwise.

The saved orientation of the default 3D view cannot be overwritten. To convert the default 3D view into a normal 3D view, rename the default 3D view.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace